04_OpenFoam/_ref/OpenFOAM-14/XiFluid/1Dlaminar/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [pressure];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            waveTransmissive;
        gamma           1.4;
        value           $internalField;
    }

    outlet
    {
        type            waveTransmissive;
        gamma           1.4;
        fieldInf        1e5;
        lInf            0.05;
        value           $internalField;
    }

    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
